{
  "GarrisonLeRockResume.pdf": {
    "description": "MY RESUME",
    "size": 224796,
    "upload_time": "2025-10-04T20:47:52.067453",
    "upload_timestamp": 1759628872.067453,
    "processed": true,
    "uploaded": true,
    "processing_status": "completed",
    "job_description": "As a full stack Senior Software Engineer, you will be joining an elite team of technical powerhouses within our Keeper Dev team. Play a pivotal role designing, developing and maintaining our internal support tools used by Keeper employees. You will work closely with cross-functional teams to deliver high-quality software solutions that meet both user and business requirements.\r\n\r\nResponsibilities\r\n\r\nOwn the ability to self-start and prioritize, plan, organize, and manage multiple tasks efficiently, in a demanding environment\r\nCollaborate with product managers, designers, and other engineers to define and implement software solutions\r\nDesign, Develop, and maintain secure and scalable solutions for Keeper’s Support Tools\r\nUtilize Java, MySQL, AWS, JavaScript\r\nBalance multiple concurrent projects with varying priorities\r\nWrite clean, maintainable, and well documented code\r\nConduct code reviews\r\nTroubleshoot and debug issues to ensure the performance, reliability, and security of applications\r\nExcel at communicating with technical and non-technical teams\r\nStay up-to-date with emerging technologies and best practices in software development\r\nRequirements\r\n5+ years of professional experience in full-stack software development\r\nBachelor’s or Master’s degree in Computer Science or equivalent discipline or equivalent experience\r\nStrong experience with Java, JavaScript, HTML, CSS and popular frameworks/libraries (e.g., React, Angular, Vue.js).\r\nExperience with database design and management (MySQL)\r\nFamiliarity with cloud platforms (AWS)\r\nExcellent problem solving and communication skills\r\nProven ability to work in an agile development environment\r\nDue to this role’s involvement in GovCloud, all applicants must be a US Person. A “U.S. Person” is defined as a U.S. citizen or a Lawful permanent resident (Green Card holder).”",
    "scores": {
      "GarrisonLeRockResume.pdf": {
        "overall_score": 57,
        "skills_match": 40,
        "experience_match": 40,
        "education_match": 100,
        "keywords_found": 5,
        "total_keywords": 12
      }
    },
    "processing_start_time": "2025-10-04T20:50:09.521645",
    "processing_end_time": "2025-10-04T20:50:45.689973",
    "recommendations": "{\n  \"scores\": {\n    \"overall_score\": 57,\n    \"skills_match\": 40,\n    \"experience_match\": 40,\n    \"education_match\": 100,\n    \"keywords_found\": 5,\n    \"total_keywords\": 12\n  },\n  \"recommendations\": \"Your resume shows potential for the Keeper Dev full-stack role, but there’s a noticeable gap in explicitly listing the core tech stack the job requires. To improve alignment, highlight hands-on experience with Java, JavaScript, HTML, CSS, and MySQL, and cite any work with React/Angular/Vue.js. If you have worked on internal tools or web apps using Java or JS-based stacks, add concrete projects and metrics (e.g., performance improvements, user adoption, or security improvements). Emphasize cross-functional collaboration, Agile experience, and code reviews. Consider adding a Projects or Experience blurb that maps to the job responsibilities (designing, developing, and maintaining secure, scalable internal tools on AWS with MySQL). Also, confirm your US Person status or eligibility for GovCloud, and clearly state citizenship or permanent residency on the resume if applicable. Finally, quantify achievements where possible (e.g., reduced deployment time, improved security posture, or automated workflows) to strengthen impact.}\""
  },
  "__MACOSX/._GarrisonLeRockResume.pdf": {
    "description": "MY RESUME",
    "size": 224796,
    "upload_time": "2025-10-04T20:47:52.067453",
    "upload_timestamp": 1759628872.067453,
    "processed": false,
    "uploaded": true,
    "processing_status": "pending",
    "job_description": "",
    "scores": {},
    "processing_start_time": null,
    "processing_end_time": null
  }
}